// Lab21.5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <string>
using namespace std;
int main()
{
	string str = "D:\\VVP\\Laboratorki\\laba21.cpp";
	int count = 0;
	for (int i = str.length() - 1; i > -1; i--)
	{
		if (str[i] != '.') count++;
		else break;
	}
	str.erase(str.length() - count - 1, count + 1);
	count = 0;
	for (int i = str.length() - 1; i > -1; i--)
	{
		if (str[i] != '\\') count++;
		else break;
	}
	str.erase(0, str.length() - count);
	cout << str << endl;
	return 0;
}


// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
