// Lab4.4.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "ru");
	double V1, V2, T, S, S1, S2;
	cout << "Введите скорость первой машины:";
	cin >> V1;
	cout << "Введите скорость второй машины:";
	cin >> V2;
	cout << "Введите начальное расстояние между ними:";
	cin >> S;
	cout << "Введите прошедшее время:";
	cin >> T;
	S1 = V1 * T;
	S2 = V2 * T;
	S = S1 + S2 + S;
	cout << "Расстояние между машинами за прошедшее время:" << S;
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
